package com.example.myshop.ui

fun handleRequestCode(code:Int):String{
    return when(code){
        201->"موفقیت آمیز ایجاد شد."
        200->"موفقیت آمیز بود."
        204->"بدون محتوا."
        206->"محتوای ناقص."
        304->"اصلاح نشده."
        305->"استفاده از پراکسی."
        400->"درخواست بد."
        401->"غیر مجاز!"
        402->"پرداخت الزامی است"
        403->"ممنوع."
        404->"نتیجه یافت نشد."
        408->"مهلت زمانی درخواست پایان یافته است."
        409->"تعارض !"
        415->"نوع رسانه پشتیبانی نمی شود."
        423->"قفل شده."
        500->"خطای سرویس دهنده ی داخلی."
        502->"دروازه ی بد"
        503->"خدمات سرور ذر ذسترس نیست."
        504->"وقفه در دروازه اینترنت"
        else->"مشکل ناشناخته."
    }
}